ErpTest/src/Documents/уатИзменениеСчетчиковТС/уатИзменениеСчетчиковТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатИзменениеСчетчиковТС</name>
  <registerRecords>InformationRegister.УдалитьУатПрохождениеТО</registerRecords>
  <registerRecords>InformationRegister.уатСчетчикиТС</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияСпидометра</name>
    <comment>Новое значение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияСчетчикаМЧ</name>
    <comment>Новое значение счетчика</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпидометрИзменен</name>
    <comment>Признак изменения показаний спидометра</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикМЧИзменен</name>
    <comment>Признак изменения показаний счетчика моточасов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <comment>ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОбслуживания</name>
    <type>
      <types>CatalogRef.уатВидыОбслуживанияТС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОбслуживания2</name>
    <type>
      <types>CatalogRef.уатВидыОбслуживанияТС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОбслуживания3</name>
    <type>
      <types>CatalogRef.уатВидыОбслуживанияТС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыработкаПриТО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыработкаПриТО2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыработкаПриТО3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПараметрВыработки2</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПараметрВыработки3</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Enums/уатТипыСчетчиковТС/уатТипыСчетчиковТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыСчетчиковТС</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Спидометр</name>
  </enumValues>
  <enumValues>
    <name>СчетчикМЧ</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/уатИзменениеСчетчиковТС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатИзменениеСчетчиковТС.Ссылка КАК Регистратор,
	|	уатИзменениеСчетчиковТС.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыСчетчиковТС.Спидометр) КАК ТипСчетчика,
	|	уатИзменениеСчетчиковТС.ПоказанияСпидометра КАК Значение,
	|	уатИзменениеСчетчиковТС.ТС
	|ИЗ
	|	Документ.уатИзменениеСчетчиковТС КАК уатИзменениеСчетчиковТС
	|ГДЕ
	|	уатИзменениеСчетчиковТС.Ссылка = &Ссылка
	|	И уатИзменениеСчетчиковТС.СпидометрИзменен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатИзменениеСчетчиковТС.Ссылка,
	|	уатИзменениеСчетчиковТС.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.уатТипыСчетчиковТС.СчетчикМЧ),
	|	уатИзменениеСчетчиковТС.ПоказанияСчетчикаМЧ,
	|	уатИзменениеСчетчиковТС.ТС
	|ИЗ
	|	Документ.уатИзменениеСчетчиковТС КАК уатИзменениеСчетчиковТС
	|ГДЕ
	|	уатИзменениеСчетчиковТС.Ссылка = &Ссылка
	|	И уатИзменениеСчетчиковТС.СчетчикМЧИзменен
	|");
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	тблСчетчики = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСчетчиковТС", тблСчетчики);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Заглушка = Истина;
КонецПроцедуры // ВыполнитьКонтроль()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Заглушка = Истина;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
